Tekla Open API Reference for Tekla Structures 2025
AnalysisAreaPolygon Methods
The AnalysisAreaPolygon type exposes the following members.
Methods
Name | Description
Add
 Adds a position to the analysis area polygon. Also adds an edge.
GetEdges
 Gets the edges of the area polygon.
GetPositions
 Gets the positions of the area polygon.
Insert
 Inserts an analysis area polygon. The AnalysisModelName has to be set.
Select
 Selects an analysis area polygon. The AnalysisObjectType has to be set.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
AnalysisAreaPolygon Class
Tekla.Structures.Analysis Namespace